; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	spectrograph3 - mode
	thermograph1 - mode
	infrared2 - mode
	image0 - mode
	spectrograph4 - mode
	star2 - direction
	groundstation4 - direction
	groundstation0 - direction
	star1 - direction
	groundstation3 - direction
	phenomenon5 - direction
	star6 - direction
	planet7 - direction
	star8 - direction
	planet9 - direction
	star10 - direction
	planet11 - direction
	phenomenon12 - direction
	planet13 - direction
	planet14 - direction
	phenomenon15 - direction
	phenomenon16 - direction
	star17 - direction
	phenomenon18 - direction
	phenomenon19 - direction
	star20 - direction
	star21 - direction
	star22 - direction
	phenomenon23 - direction
	phenomenon24 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 groundstation3)
	(supports instrument1 image0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 groundstation3)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon12)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 star1)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 star2)
	(supports instrument5 image0)
	(calibration_target instrument5 groundstation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 groundstation0)
	(supports instrument6 image0)
	(calibration_target instrument6 groundstation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 star20)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 star1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 phenomenon5)
	(supports instrument8 spectrograph3)
	(supports instrument8 image0)
	(calibration_target instrument8 star1)
	(supports instrument9 image0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 groundstation0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 planet14)
	(supports instrument10 image0)
	(supports instrument10 spectrograph4)
	(supports instrument10 infrared2)
	(calibration_target instrument10 star1)
	(supports instrument11 spectrograph4)
	(calibration_target instrument11 groundstation3)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 star8)
)
(:goal (and
	(pointing satellite2 star6)
	(have_image star6 spectrograph3)
	(have_image planet7 spectrograph4)
	(have_image star8 thermograph1)
	(have_image planet9 spectrograph4)
	(have_image star10 spectrograph3)
	(have_image planet11 infrared2)
	(have_image phenomenon12 spectrograph4)
	(have_image planet13 infrared2)
	(have_image planet14 infrared2)
	(have_image phenomenon16 spectrograph3)
	(have_image star17 infrared2)
	(have_image phenomenon18 image0)
	(have_image phenomenon19 thermograph1)
	(have_image star20 thermograph1)
	(have_image star21 infrared2)
	(have_image star22 spectrograph3)
	(have_image phenomenon23 image0)
	(have_image phenomenon24 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument10)
   goals met: 0 of 19
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 19
3. (turn_to satellite5 phenomenon18 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 phenomenon18)
   goals met: 0 of 19
4. (turn_to satellite5 planet11 phenomenon18)
   deleted: (pointing satellite5 phenomenon18)
   added: (pointing satellite5 planet11)
   goals met: 0 of 19
5. (turn_to satellite2 star6 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 star6)
   goals met: 1 of 19
6. (turn_to satellite1 phenomenon16 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 19
7. (turn_to satellite1 star1 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star1)
   goals met: 1 of 19
8. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 19
9. (turn_to satellite1 phenomenon12 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 19
10. (take_image satellite1 phenomenon12 instrument3 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 2 of 19
11. (turn_to satellite1 phenomenon16 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 19
12. (take_image satellite1 phenomenon16 instrument3 spectrograph3)
   added: (have_image phenomenon16 spectrograph3)
   goals met: 3 of 19
13. (turn_to satellite1 phenomenon19 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon19)
   goals met: 3 of 19
14. (take_image satellite1 phenomenon19 instrument3 thermograph1)
   added: (have_image phenomenon19 thermograph1)
   goals met: 4 of 19
15. (turn_to satellite1 phenomenon24 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon24)
   goals met: 4 of 19
16. (take_image satellite1 phenomenon24 instrument3 thermograph1)
   added: (have_image phenomenon24 thermograph1)
   goals met: 5 of 19
17. (turn_to satellite1 planet7 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 planet7)
   goals met: 5 of 19
18. (take_image satellite1 planet7 instrument3 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 6 of 19
19. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 6 of 19
20. (take_image satellite1 planet9 instrument3 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 7 of 19
21. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 7 of 19
22. (take_image satellite1 star10 instrument3 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 8 of 19
23. (turn_to satellite1 star20 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star20)
   goals met: 8 of 19
24. (take_image satellite1 star20 instrument3 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 9 of 19
25. (turn_to satellite1 star22 star20)
   deleted: (pointing satellite1 star20)
   added: (pointing satellite1 star22)
   goals met: 9 of 19
26. (take_image satellite1 star22 instrument3 spectrograph3)
   added: (have_image star22 spectrograph3)
   goals met: 10 of 19
27. (turn_to satellite1 star6 star22)
   deleted: (pointing satellite1 star22)
   added: (pointing satellite1 star6)
   goals met: 10 of 19
28. (take_image satellite1 star6 instrument3 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 11 of 19
29. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 11 of 19
30. (take_image satellite1 star8 instrument3 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 12 of 19
31. (turn_to satellite5 star1 planet11)
   deleted: (pointing satellite5 planet11)
   added: (pointing satellite5 star1)
   goals met: 12 of 19
32. (calibrate satellite5 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 12 of 19
33. (turn_to satellite5 phenomenon18 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 phenomenon18)
   goals met: 12 of 19
34. (take_image satellite5 phenomenon18 instrument10 image0)
   added: (have_image phenomenon18 image0)
   goals met: 13 of 19
35. (turn_to satellite5 phenomenon23 phenomenon18)
   deleted: (pointing satellite5 phenomenon18)
   added: (pointing satellite5 phenomenon23)
   goals met: 13 of 19
36. (take_image satellite5 phenomenon23 instrument10 image0)
   added: (have_image phenomenon23 image0)
   goals met: 14 of 19
37. (turn_to satellite5 planet11 phenomenon23)
   deleted: (pointing satellite5 phenomenon23)
   added: (pointing satellite5 planet11)
   goals met: 14 of 19
38. (take_image satellite5 planet11 instrument10 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 15 of 19
39. (turn_to satellite5 planet13 planet11)
   deleted: (pointing satellite5 planet11)
   added: (pointing satellite5 planet13)
   goals met: 15 of 19
40. (take_image satellite5 planet13 instrument10 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 16 of 19
41. (turn_to satellite5 planet14 planet13)
   deleted: (pointing satellite5 planet13)
   added: (pointing satellite5 planet14)
   goals met: 16 of 19
42. (take_image satellite5 planet14 instrument10 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 17 of 19
43. (turn_to satellite5 star17 planet14)
   deleted: (pointing satellite5 planet14)
   added: (pointing satellite5 star17)
   goals met: 17 of 19
44. (take_image satellite5 star17 instrument10 infrared2)
   added: (have_image star17 infrared2)
   goals met: 18 of 19
45. (turn_to satellite5 star21 star17)
   deleted: (pointing satellite5 star17)
   added: (pointing satellite5 star21)
   goals met: 18 of 19
46. (take_image satellite5 star21 instrument10 infrared2)
   added: (have_image star21 infrared2)
   goals met: 19 of 19
